Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tim8.h
// CCR5 Configuration

#define TIM8_CCR5_GC5C3             (0x1u<<31)
#define TIM8_CCR5_GC5C2             (0x1u<<30)
#define TIM8_CCR5_GC5C1             (0x1u<<29)
#define TIM8_CCR5_CCR5              (0xFFFFFu<<0)
#define TIM8_CCR5_CCR5_0            (0x1u<<0)

#define TIM8_CCR5_GC5C3_B_0X0       (0x0u<<31)
#define TIM8_CCR5_GC5C3_B_0X1       (0x1u<<31)
#define TIM8_CCR5_GC5C2_B_0X0       (0x0u<<30)
#define TIM8_CCR5_GC5C2_B_0X1       (0x1u<<30)
#define TIM8_CCR5_GC5C1_B_0X0       (0x0u<<29)
#define TIM8_CCR5_GC5C1_B_0X1       (0x1u<<29)

// CCR6 Configuration

#define TIM8_CCR6_CCR6              (0xFFFFFu<<0)
#define TIM8_CCR6_CCR6_0            (0x1u<<0)

// CCMR3 Configuration

#define TIM8_CCMR3_OC6M_1           (0x1u<<24)
#define TIM8_CCMR3_OC5M_1           (0x1u<<16)
#define TIM8_CCMR3_OC6CE            (0x1u<<15)
#define TIM8_CCMR3_OC6M             (0x7u<<12)
#define TIM8_CCMR3_OC6M_0           (0x1u<<12)
#define TIM8_CCMR3_OC6PE            (0x1u<<11)
#define TIM8_CCMR3_OC6FE            (0x1u<<10)
#define TIM8_CCMR3_OC5CE            (0x1u<<7)
#define TIM8_CCMR3_OC5M             (0x7u<<4)
#define TIM8_CCMR3_OC5M_0           (0x1u<<4)
#define TIM8_CCMR3_OC5PE            (0x1u<<3)
#define TIM8_CCMR3_OC5FE            (0x1u<<2)

// DTR2 Configuration

#define TIM8_DTR2_DTPE              (0x1u<<17)
#define TIM8_DTR2_DTAE              (0x1u<<16)
#define TIM8_DTR2_DTGF              (0xFFu<<0)
#define TIM8_DTR2_DTGF_0            (0x1u<<0)

#define TIM8_DTR2_DTPE_B_0X0        (0x0u<<17)
#define TIM8_DTR2_DTPE_B_0X1        (0x1u<<17)
#define TIM8_DTR2_DTAE_B_0X0        (0x0u<<16)
#define TIM8_DTR2_DTAE_B_0X1        (0x1u<<16)

// ECR Configuration

#define TIM8_ECR_PWPRSC             (0x7u<<24)
#define TIM8_ECR_PWPRSC_0           (0x1u<<24)
#define TIM8_ECR_PW                 (0xFFu<<16)
#define TIM8_ECR_PW_0               (0x1u<<16)
#define TIM8_ECR_IPOS               (0x3u<<6)
#define TIM8_ECR_IPOS_0             (0x1u<<6)
#define TIM8_ECR_FIDX               (0x1u<<5)
#define TIM8_ECR_IBLK               (0x3u<<3)
#define TIM8_ECR_IBLK_0             (0x1u<<3)
#define TIM8_ECR_IDIR               (0x3u<<1)
#define TIM8_ECR_IDIR_0             (0x1u<<1)
#define TIM8_ECR_IE                 (0x1u<<0)

#define TIM8_ECR_IPOS_B_0X0         (0x0u<<6)
#define TIM8_ECR_IPOS_B_0X1         (0x1u<<6)
#define TIM8_ECR_IPOS_B_0X2         (0x2u<<6)
#define TIM8_ECR_IPOS_B_0X3         (0x3u<<6)
#define TIM8_ECR_FIDX_B_0X0         (0x0u<<5)
#define TIM8_ECR_FIDX_B_0X1         (0x1u<<5)
#define TIM8_ECR_IBLK_B_0X0         (0x0u<<3)
#define TIM8_ECR_IBLK_B_0X1         (0x1u<<3)
#define TIM8_ECR_IBLK_B_0X2         (0x2u<<3)
#define TIM8_ECR_IDIR_B_0X0         (0x0u<<1)
#define TIM8_ECR_IDIR_B_0X1         (0x1u<<1)
#define TIM8_ECR_IDIR_B_0X2         (0x2u<<1)
#define TIM8_ECR_IE_B_0X0           (0x0u<<0)
#define TIM8_ECR_IE_B_0X1           (0x1u<<0)

// TISEL Configuration

#define TIM8_TISEL_TI4SEL           (0xFu<<24)
#define TIM8_TISEL_TI4SEL_0         (0x1u<<24)
#define TIM8_TISEL_TI3SEL           (0xFu<<16)
#define TIM8_TISEL_TI3SEL_0         (0x1u<<16)
#define TIM8_TISEL_TI2SEL           (0xFu<<8)
#define TIM8_TISEL_TI2SEL_0         (0x1u<<8)
#define TIM8_TISEL_TI1SEL           (0xFu<<0)
#define TIM8_TISEL_TI1SEL_0         (0x1u<<0)

#define TIM8_TISEL_TI4SEL_B_0X0     (0x0u<<24)
#define TIM8_TISEL_TI4SEL_B_0X1     (0x1u<<24)
#define TIM8_TISEL_TI4SEL_B_0XF     (0xFu<<24)
#define TIM8_TISEL_TI3SEL_B_0X0     (0x0u<<16)
#define TIM8_TISEL_TI3SEL_B_0X1     (0x1u<<16)
#define TIM8_TISEL_TI3SEL_B_0XF     (0xFu<<16)
#define TIM8_TISEL_TI2SEL_B_0X0     (0x0u<<8)
#define TIM8_TISEL_TI2SEL_B_0X1     (0x1u<<8)
#define TIM8_TISEL_TI2SEL_B_0XF     (0xFu<<8)
#define TIM8_TISEL_TI1SEL_B_0X0     (0x0u<<0)
#define TIM8_TISEL_TI1SEL_B_0X1     (0x1u<<0)
#define TIM8_TISEL_TI1SEL_B_0XF     (0xFu<<0)

// AF1 Configuration

#define TIM8_AF1_ETRSEL             (0xFu<<14)
#define TIM8_AF1_ETRSEL_0           (0x1u<<14)
#define TIM8_AF1_BKCMP4P            (0x1u<<13)
#define TIM8_AF1_BKCMP3P            (0x1u<<12)
#define TIM8_AF1_BKCMP2P            (0x1u<<11)
#define TIM8_AF1_BKCMP1P            (0x1u<<10)
#define TIM8_AF1_BKINP              (0x1u<<9)
#define TIM8_AF1_BKCMP8E            (0x1u<<8)
#define TIM8_AF1_BKCMP7E            (0x1u<<7)
#define TIM8_AF1_BKCMP6E            (0x1u<<6)
#define TIM8_AF1_BKCMP5E            (0x1u<<5)
#define TIM8_AF1_BKCMP4E            (0x1u<<4)
#define TIM8_AF1_BKCMP3E            (0x1u<<3)
#define TIM8_AF1_BKCMP2E            (0x1u<<2)
#define TIM8_AF1_BKCMP1E            (0x1u<<1)
#define TIM8_AF1_BKINE              (0x1u<<0)

#define TIM8_AF1_ETRSEL_B_0X0       (0x0u<<14)
#define TIM8_AF1_ETRSEL_B_0X1       (0x1u<<14)
#define TIM8_AF1_ETRSEL_B_0XF       (0xFu<<14)
#define TIM8_AF1_BKCMP4P_B_0X0      (0x0u<<13)
#define TIM8_AF1_BKCMP4P_B_0X1      (0x1u<<13)
#define TIM8_AF1_BKCMP3P_B_0X0      (0x0u<<12)
#define TIM8_AF1_BKCMP3P_B_0X1      (0x1u<<12)
#define TIM8_AF1_BKCMP2P_B_0X0      (0x0u<<11)
#define TIM8_AF1_BKCMP2P_B_0X1      (0x1u<<11)
#define TIM8_AF1_BKCMP1P_B_0X0      (0x0u<<10)
#define TIM8_AF1_BKCMP1P_B_0X1      (0x1u<<10)
#define TIM8_AF1_BKINP_B_0X0        (0x0u<<9)
#define TIM8_AF1_BKINP_B_0X1        (0x1u<<9)
#define TIM8_AF1_BKCMP8E_B_0X0      (0x0u<<8)
#define TIM8_AF1_BKCMP8E_B_0X1      (0x1u<<8)
#define TIM8_AF1_BKCMP7E_B_0X0      (0x0u<<7)
#define TIM8_AF1_BKCMP7E_B_0X1      (0x1u<<7)
#define TIM8_AF1_BKCMP6E_B_0X0      (0x0u<<6)
#define TIM8_AF1_BKCMP6E_B_0X1      (0x1u<<6)
#define TIM8_AF1_BKCMP5E_B_0X0      (0x0u<<5)
#define TIM8_AF1_BKCMP5E_B_0X1      (0x1u<<5)
#define TIM8_AF1_BKCMP4E_B_0X0      (0x0u<<4)
#define TIM8_AF1_BKCMP4E_B_0X1      (0x1u<<4)
#define TIM8_AF1_BKCMP3E_B_0X0      (0x0u<<3)
#define TIM8_AF1_BKCMP3E_B_0X1      (0x1u<<3)
#define TIM8_AF1_BKCMP2E_B_0X0      (0x0u<<2)
#define TIM8_AF1_BKCMP2E_B_0X1      (0x1u<<2)
#define TIM8_AF1_BKCMP1E_B_0X0      (0x0u<<1)
#define TIM8_AF1_BKCMP1E_B_0X1      (0x1u<<1)
#define TIM8_AF1_BKINE_B_0X0        (0x0u<<0)
#define TIM8_AF1_BKINE_B_0X1        (0x1u<<0)

